#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖``
<details><summary>Show Plan</summary>
```terraform
google_compute_instance.server03: Refreshing state... [id=projects/iac-trabalho-1/zones/us-central1-c/instances/server03]
google_compute_instance.server02: Refreshing state... [id=projects/iac-trabalho-1/zones/us-central1-c/instances/server02]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.server03 must be replaced
-/+ resource "google_compute_instance" "server03" {
      ~ cpu_platform            = "Intel Broadwell" -> (known after apply)
      ~ current_status          = "RUNNING" -> (known after apply)
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/iac-trabalho-1/zones/us-central1-c/instances/server03" -> (known after apply)
      ~ instance_id             = "5352007983940812816" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
      - metadata                = {
          - "ssh-keys" = <<-EOT
                juliavit1999:ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBGD3iOOLUeLMej3uRbSavkM5ax0VlA10mRS7b9V0Le9od4yEQuJgtHlM/uuh3MMcQoFAkshwZH1P8V1d5dEb6Q4= google-ssh {"userName":"juliavit1999@gmail.com","expireOn":"2022-11-17T00:27:05+0000"}
                juliavit1999:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCcKLebWZbY1/ozm2GPt/p88P3k+VEPbT1VMIRTukg9Gd995xrrsyMIvVLH57ZUPiqEzLCjpKPCYjLLQJm5JF7FXCQpXs1OvX4t2oVaA3wT9/3mHyMNUVkVnYpjqFX5nAMFXO/pG0e1a8IYM+lfeFqVCcB5T4wRWiCHETMmsHrZRP0dtMkACqgMpl+ErALw9+8dQkqvwfpVK8PppsVurqRgIgIl8GjaPTVF91MkEQ+Jd3nMFJDa/9OHwRVHDZchhy7mq6msAttk4SLS+2nP0zy07bBvGz1REXvt8BaSUDONG1SoInHfAdA3aXg1rxXGXcNIYuerw72IA1/xjapcNY/T google-ssh {"userName":"juliavit1999@gmail.com","expireOn":"2022-11-17T00:27:10+0000"}
            EOT
        } -> null
      ~ metadata_fingerprint    = "ybhzIs8F4Dg=" -> (known after apply)
      ~ metadata_startup_script = <<-EOT # forces replacement
          - #!/bin/bash
          + #!/usr/bin/env bash
            sudo apt update
            sudo apt install openjdk-11-jdk -y
            
            curl -fsSL https://pkg.jenkins.io/debian-stable/jenkins.io.key | sudo tee /usr/share/keyrings/jenkins-keyring.asc &gt; /dev/null
            echo deb [signed-by=/usr/share/keyrings/jenkins-keyring.asc] https://pkg.jenkins.io/debian-stable binary/ | sudo tee /etc/apt/sources.list.d/jenkins.list &gt; /dev/null
            
            sudo apt update
            sudo apt install jenkins -y
        EOT
      + min_cpu_platform        = (known after apply)
        name                    = "server03"
      ~ project                 = "iac-trabalho-1" -> (known after apply)
      - resource_policies       = [] -> null
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/iac-trabalho-1/zones/us-central1-c/instances/server03" -> (known after apply)
      - tags                    = [] -> null
      ~ tags_fingerprint        = "42WmSpB8rSM=" -> (known after apply)
      ~ zone                    = "us-central1-c" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/iac-trabalho-1/zones/us-central1-c/disks/server03" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20221018" -> "ubuntu-os-cloud/ubuntu-1804-lts"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      ~ network_interface {
          + ipv6_access_type   = (known after apply)
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/iac-trabalho-1/global/networks/default" -> "default"
          ~ network_ip         = "10.128.0.13" -> (known after apply)
          - queue_count        = 0 -> null
          ~ stack_type         = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/iac-trabalho-1/regions/us-central1/subnetworks/default" -> (known after apply)
          ~ subnetwork_project = "iac-trabalho-1" -> (known after apply)

          ~ access_config {
              ~ nat_ip       = "34.28.100.150" -> (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart           = true -> (known after apply)
          + instance_termination_action = (known after apply)
          ~ min_node_cpus               = 0 -> (known after apply)
          ~ on_host_maintenance         = "MIGRATE" -> (known after apply)
          ~ preemptible                 = false -> (known after apply)
          ~ provisioning_model          = "STANDARD" -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @juliavpaiva, Action: `pull_request`, Working Directory: `gcp/main-infrastructure/`, Workflow: `GCP - Create terraform plan for Main Infrastructure`*